app/controllers/posts_controller.rb

  def index
    #@posts = Post.all
    @posts = Post.paginate( :page => params[:page],
                            :per_page => 2
                          )
---
SELECT "posts".* FROM "posts" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def show
    @post = Post.find(params[:id])
    @comment = @post.comments.paginate(:page => params[:page],:per_page => 1)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 2

  def edit
    @post = Post.find(params[:id])
    @tags = ''
    @tagsize = @post.tags.size
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "tags".* FROM "tags" WHERE "tags"."post_id" = 3

def create
    #@tag = params[:post][:tags_attributes]

    # shanghai-zhou(105703655) 10:31:32 写的另一种方法
    # tags = ['he', 'll', 'o']
    # @tags = tags.map do |t|
    # if Tag.find_by_name(t).blank?
    # Tag.create(:name=>t)
    # end
    # Tag.find_by_name t
    # end
    # @post.tags = @tags
    # @post.save

    @tagarr = params[:post][:tags_attributes].split(" ")
    @tag = {}
    @tagarr.each_with_index do |tag,i|
    #@tagarr.each do |tag|
      @tag[i] = {:name => tag}
    end

    @postreset = params[:post]
    @postreset["tags_attributes"] = @tag
    @post = Post.new(@postreset)
    #@post = Post.new(@postreset)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test content"], ["created_at", Tue, 03 Jul 2012 02:35:53 UTC +00:00], ["name", "testname"], ["title", "testtitle"], ["updated_at", Tue, 03 Jul 2012 02:35:53 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
    @tagarr = params[:post][:tags_attributes].split(" ")
    puts @tagarr
    @tag = {}
    @tagarr.each_with_index do |tag,i|
      @tag[i] = {:name =>tag}
    end

    @tagreset = params[:post]
    @tagreset["tags_attributes"] ={}
    @tagreset["tags_attributes"] = @tag
    @post.tags=[]
    #puts @tagreset
    #render :layout => false
    respond_to do |format|
     if @post.update_attributes(@tagreset)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "content" = '<h1>序：</h1>