app/controllers/users_controller.rb

	def index
		#@posts = Post.all
	    @users = User.paginate(:page => params[:page],:per_page => 2)
---
SELECT "users".* FROM "users" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users"